{"vllm":0,"code":1,"conduct":2,"our":3,"pledge":4,"we":5,"members":6,"contributors":7,"leaders":8,"make":9,"participation":10,"community":11,"harassment":12,"free":13,"experience":14,"everyone":15,"regardless":16,"age":17,"body":18,"size":19,"visible":20,"invisible":21,"disability":22,"ethnicity":23,"sex":24,"characteristics":25,"gender":26,"identity":27,"expression":28,"level":29,"education":30,"socioeconomic":31,"status":32,"nationality":33,"personal":34,"appearance":35,"race":36,"caste":37,"color":38,"religion":39,"sexual":40,"orientation":41,"act":42,"interact":43,"ways":44,"contribute":45,"open":46,"welcoming":47,"diverse":48,"inclusive":49,"healthy":50,"standards":51,"examples":52,"behavior":53,"contributes":54,"positive":55,"environment":56,"include":57,"demonstrating":58,"empathy":59,"kindness":60,"toward":61,"other":62,"people":63,"being":64,"respectful":65,"differing":66,"opinions":67,"viewpoints":68,"experiences":69,"giving":70,"gracefully":71,"accepting":72,"constructive":73,"feedback":74,"responsibility":75,"apologizing":76,"those":77,"affected":78,"mistakes":79,"learning":80,"from":81,"focusing":82,"what":83,"best":84,"just":85,"us":86,"individuals":87,"overall":88,"unacceptable":89,"use":90,"sexualized":91,"language":92,"imagery":93,"attention":94,"advances":95,"any":96,"kind":97,"trolling":98,"insulting":99,"derogatory":100,"comments":101,"political":102,"attacks":103,"public":104,"private":105,"publishing":106,"others":107,"information":108,"physical":109,"email":110,"address":111,"without":112,"explicit":113,"permission":114,"which":115,"could":116,"reasonably":117,"considered":118,"inappropriate":119,"professional":120,"setting":121,"enforcement":122,"responsibilities":123,"responsible":124,"clarifying":125,"enforcing":126,"acceptable":127,"take":128,"appropriate":129,"fair":130,"corrective":131,"action":132,"response":133,"deem":134,"threatening":135,"offensive":136,"harmful":137,"have":138,"right":139,"remove":140,"edit":141,"reject":142,"commits":143,"wiki":144,"edits":145,"issues":146,"contributions":147,"aligned":148,"communicate":149,"reasons":150,"moderation":151,"decisions":152,"when":153,"scope":154,"applies":155,"within":156,"all":157,"spaces":158,"also":159,"individual":160,"officially":161,"representing":162,"using":163,"official":164,"posting":165,"via":166,"social":167,"media":168,"account":169,"acting":170,"appointed":171,"representative":172,"online":173,"offline":174,"irl":175,"event":176,"instances":177,"abusive":178,"harassing":179,"otherwise":180,"may":181,"reported":182,"channel":183,"slack":184,"https":185,"ai":186,"complaints":187,"reviewed":188,"investigated":189,"promptly":190,"fairly":191,"obligated":192,"respect":193,"privacy":194,"security":195,"reporter":196,"incident":197,"guidelines":198,"follow":199,"impact":200,"determining":201,"consequences":202,"violation":203,"correction":204,"deemed":205,"unprofessional":206,"unwelcome":207,"consequence":208,"written":209,"warning":210,"providing":211,"clarity":212,"around":213,"nature":214,"explanation":215,"why":216,"apology":217,"requested":218,"through":219,"single":220,"series":221,"actions":222,"continued":223,"interaction":224,"involved":225,"including":226,"unsolicited":227,"specified":228,"period":229,"time":230,"includes":231,"avoiding":232,"interactions":233,"well":234,"external":235,"channels":236,"like":237,"violating":238,"terms":239,"lead":240,"temporary":241,"permanent":242,"ban":243,"serious":244,"sustained":245,"sort":246,"communication":247,"allowed":248,"during":249,"pattern":250,"aggression":251,"disparagement":252,"classes":253,"attribution":254,"adapted":255,"contributor":256,"covenant":257,"www":258,"org":259,"version":260,"available":261,"v2":262,"code_of_conduct":263,"html":264,"were":265,"inspired":266,"mozilla":267,"ladder":268,"github":269,"com":270,"inclusion":271,"answers":272,"common":273,"questions":274,"about":275,"see":276,"faq":277,"translations":278,"markdownlint":279,"disable":280,"md001":281,"md041":282,"align":283,"center":284,"picture":285,"source":286,"prefers":287,"scheme":288,"dark":289,"srcset":290,"raw":291,"githubusercontent":292,"project":293,"main":294,"docs":295,"assets":296,"logos":297,"logo":298,"text":299,"png":300,"img":301,"alt":302,"src":303,"light":304,"width":305,"55":306,"h3":307,"easy":308,"fast":309,"cheap":310,"llm":311,"serving":312,"href":313,"documentation":314,"blog":315,"arxiv":316,"abs":317,"2309":318,"06180":319,"paper":320,"vllm_project":321,"twitter":322,"discuss":323,"user":324,"forum":325,"developer":326,"latest":327,"news":328,"2025":329,"08":330,"hosted":331,"beijing":332,"meetup":333,"mp":334,"weixin":335,"qq":336,"dgkwg1wfpwgo2jcdtqqhxa":337,"large":338,"scale":339,"deployment":340,"please":341,"find":342,"slides":343,"here":344,"drive":345,"google":346,"folders":347,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":348,"recording":349,"chaspark":350,"live":351,"1166916873711665152":352,"05":353,"nyc":354,"lu":355,"ma":356,"c1rqyf1f":357,"presentation":358,"1_q_aw_iomjwuimf1s1ym":359,"zhjxz8cuel0ijvaquoybea":360,"usp":361,"sharing":362,"now":363,"under":364,"pytorch":365,"foundation":366,"announcement":367,"welcomes":368,"01":369,"excited":370,"announce":371,"alpha":372,"release":373,"v1":374,"major":375,"architectural":376,"upgrade":377,"7x":378,"speedup":379,"clean":380,"optimized":381,"execution":382,"loop":383,"zero":384,"overhead":385,"prefix":386,"caching":387,"enhanced":388,"multimodal":389,"support":390,"more":391,"check":392,"out":393,"post":394,"27":395,"details":396,"summary":397,"previous":398,"04":399,"asia":400,"day":401,"sginnovate":402,"limited":403,"availability":404,"morning":405,"evening":406,"slots":407,"remaining":408,"inaugural":409,"team":410,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":411,"03":412,"ollama":413,"inference":414,"night":415,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":416,"first":417,"china":418,"n77gibl2coratqhtveazfg":419,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":420,"east":421,"coast":422,"7mu4k4xx":423,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":424,"slide":425,"id":426,"g31441846c39_0_0":427,"02":428,"ninth":429,"h7g3kuj9":430,"meta":431,"1jzc_pzvxrvnsfvcw":432,"v4cfxb6pn7zz2cyp_flwo05aqg":433,"amd":434,"file":435,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":436,"view":437,"posted":438,"eighth":439,"zep56hui":440,"cloud":441,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":442,"1h24phewanyrl11xy5dxubvrc9f9kkjix":443,"2024":444,"12":445,"joins":446,"ecosystem":447,"11":448,"seventh":449,"h0qvrajz":450,"snowflake":451,"1e3cxqbv3jsfgp30swyvs3em_tw":452,"ghohj9pajgk6kr54":453,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":454,"10":455,"created":456,"coordinating":457,"discussing":458,"features":459,"feel":460,"join":461,"ray":462,"summit":463,"held":464,"special":465,"track":466,"opening":467,"talk":468,"1b_kqxphbtra_mdf":469,"tr6i8rwdou5qotznceg2mkzxehm":470,"learn":471,"talks":472,"youtube":473,"playlist":474,"list":475,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":476,"users":477,"09":478,"sixth":479,"87q3nvnh":480,"nvidia":481,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":482,"9wqyp7ny93xrs":483,"07":484,"fifth":485,"lp0gyjqr":486,"aws":487,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":488,"partnership":489,"supports":490,"llama":491,"fp8":492,"quantization":493,"pipeline":494,"parallelism":495,"23":496,"llama31":497,"06":498,"fourth":499,"agivllm":500,"cloudflare":501,"bentoml":502,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":503,"third":504,"robloxandvllmmeetup2024":505,"splashthat":506,"roblox":507,"1a":508,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":509,"second":510,"ygxbpzhl":511,"ibm":512,"12mi2skabnuw5rbwxdyy":513,"hthth4imsnceoq10jdqbxga":514,"2023":515,"a16z":516,"1ql":517,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":518,"would":519,"express":520,"sincere":521,"gratitude":522,"andreessen":523,"horowitz":524,"30":525,"supporting":526,"generous":527,"grant":528,"development":529,"research":530,"released":531,"fastchat":532,"integration":533,"has":534,"powered":535,"lmsys":536,"vicuna":537,"chatbot":538,"arena":539,"chat":540,"since":541,"mid":542,"april":543,"library":544,"originally":545,"developed":546,"sky":547,"computing":548,"lab":549,"cs":550,"berkeley":551,"edu":552,"uc":553,"evolved":554,"driven":555,"both":556,"academia":557,"industry":558,"state":559,"art":560,"throughput":561,"efficient":562,"management":563,"key":564,"value":565,"memory":566,"pagedattention":567,"20":568,"continuous":569,"batching":570,"incoming":571,"requests":572,"model":573,"cuda":574,"hip":575,"graph":576,"quantizations":577,"gptq":578,"2210":579,"17323":580,"awq":581,"2306":582,"00978":583,"autoround":584,"05516":585,"int4":586,"int8":587,"kernels":588,"flashattention":589,"flashinfer":590,"speculative":591,"decoding":592,"chunked":593,"prefill":594,"flexible":595,"seamless":596,"popular":597,"hugging":598,"face":599,"models":600,"high":601,"various":602,"algorithms":603,"parallel":604,"sampling":605,"beam":606,"search":607,"tensor":608,"data":609,"expert":610,"distributed":611,"streaming":612,"outputs":613,"openai":614,"compatible":615,"api":616,"server":617,"gpus":618,"cpus":619,"intel":620,"powerpc":621,"tpu":622,"neuron":623,"multi":624,"lora":625,"seamlessly":626,"most":627,"huggingface":628,"transformer":629,"llms":630,"mixture":631,"mixtral":632,"deepseek":633,"v3":634,"embedding":635,"e5":636,"mistral":637,"modal":638,"llava":639,"full":640,"supported":641,"en":642,"supported_models":643,"getting":644,"started":645,"install":646,"pip":647,"getting_started":648,"installation":649,"gpu":650,"index":651,"build":652,"wheel":653,"bash":654,"visit":655,"quickstart":656,"contributing":657,"welcome":658,"collaborations":659,"how":660,"get":661,"sponsors":662,"compute":663,"resources":664,"testing":665,"following":666,"organizations":667,"thank":668,"you":669,"your":670,"note":671,"them":672,"alphabetical":673,"order":674,"keep":675,"consistent":676,"md":677,"cash":678,"donations":679,"dropbox":680,"sequoia":681,"capital":682,"skywork":683,"zhenfund":684,"alibaba":685,"anyscale":686,"crusoe":687,"databricks":688,"deepinfra":689,"lambda":690,"nebius":691,"novita":692,"replicate":693,"runpod":694,"trainy":695,"san":696,"diego":697,"sponsor":698,"fundraising":699,"venue":700,"opencollective":701,"plan":702,"fund":703,"maintenance":704,"adoption":705,"citation":706,"cite":707,"bibtex":708,"inproceedings":709,"kwon2023efficient":710,"title":711,"author":712,"woosuk":713,"kwon":714,"zhuohan":715,"li":716,"siyuan":717,"zhuang":718,"ying":719,"sheng":720,"lianmin":721,"zheng":722,"cody":723,"hao":724,"yu":725,"joseph":726,"gonzalez":727,"zhang":728,"ion":729,"stoica":730,"booktitle":731,"proceedings":732,"acm":733,"sigops":734,"29th":735,"symposium":736,"operating":737,"systems":738,"principles":739,"year":740,"contact":741,"start":742,"technical":743,"feature":744,"fellow":745,"disclosures":746,"advisories":747,"partnerships":748,"lists":749,"mailto":750,"end":751,"kit":752,"wish":753,"refer":754,"repo":755,"policy":756,"reporting":757,"report":758,"privately":759,"vulnerability":760,"submission":761,"form":762,"new":763,"issue":764,"triage":765,"reports":766,"triaged":767,"vulnerability_management":768,"threat":769,"guide":770,"usage":771,"assumptions":772,"recommendations":773,"blob":774,"securely":775,"severity":776,"determine":777,"risk":778,"each":779,"taking":780,"dealing":781,"past":782,"versions":783,"defaults":784,"cases":785,"categories":786,"critical":787,"vulnerabilities":788,"allow":789,"remote":790,"attackers":791,"execute":792,"arbitrary":793,"control":794,"system":795,"significantly":796,"compromise":797,"confidentiality":798,"integrity":799,"privileges":800,"needed":801,"network":802,"deserialization":803,"exploit":804,"chains":805,"generally":806,"rated":807,"cvss":808,"flaws":809,"elevated":810,"rce":811,"specific":812,"contexts":813,"significant":814,"loss":815,"require":816,"advanced":817,"conditions":818,"some":819,"trust":820,"modes":821,"node":822,"where":823,"privileged":824,"access":825,"required":826,"typically":827,"scores":828,"between":829,"moderate":830,"cause":831,"denial":832,"service":833,"partial":834,"disruption":835,"do":836,"breach":837,"rating":838,"low":839,"minor":840,"informational":841,"logging":842,"errors":843,"non":844,"exploitable":845,"weaknesses":846,"local":847,"privilege":848,"offer":849,"negligible":850,"side":851,"hash":852,"collisions":853,"often":854,"less":855,"than":856,"prenotification":857,"certain":858,"prenotify":859,"vendors":860,"ship":861,"purpose":862,"coordinated":863,"fixes":864,"severe":865,"notification":866,"adding":867,"contacts":868,"advisory":869,"few":870,"days":871,"before":872,"added":873,"group":874,"send":875,"copying":876,"vendor":877,"analyzed":878,"case":879,"basis":880,"withdraw":881,"receiving":882,"future":883,"prenotifications":884,"membership":885,"change":886,"based":887,"refinements":888,"who":889,"included":890,"releasing":891,"releases":892,"reliable":893,"base":894,"packaged":895,"binary":896,"format":897,"can":898,"conveniently":899,"accessed":900,"pypi":901,"serve":902,"milestones":903,"newly":904,"improvements":905,"upcoming":906,"changes":907,"affect":908,"potential":909,"breaking":910,"versioning":911,"uses":912,"shifted":913,"patch":914,"every":915,"weeks":916,"contain":917,"bug":918,"opposed":919,"semver":920,"contains":921,"only":922,"backwards":923,"need":924,"made":925,"post1":926,"_major_":927,"milestone":928,"incompatible":929,"similar":930,"_minor_":931,"_patch_":932,"_post1_":933,"_patch":934,"1_":935,"either":936,"implicit":937,"cadence":938,"bi":939,"weekly":940,"after":941,"same":942,"branch":943,"dates":944,"below":945,"tentative":946,"optional":947,"date":948,"jan":949,"feb":950,"mar":951,"apr":952,"jun":953,"jul":954,"13":955,"aug":956,"14":957,"15":958,"sep":959,"16":960,"17":961,"oct":962,"18":963,"19":964,"nov":965,"21":966,"dec":967,"22":968,"built":969,"dedicated":970,"cut":971,"performed":972,"previously":973,"reused":974,"builds":975,"triggered":976,"push":977,"rc":978,"tag":979,"vx":980,"rc1":981,"enables":982,"test":983,"multiple":984,"rcs":985,"final":986,"does":987,"trigger":988,"used":989,"notes":990,"monitor":991,"reverts":992,"apply":993,"cherry":994,"pick":995,"criteria":996,"approach":997,"finalizing":998,"clear":999,"picks":1000,"process":1001,"land":1002,"pr":1003,"ensure":1004,"sufficient":1005,"complete":1006,"thorough":1007,"round":1008,"stable":1009,"regression":1010,"functional":1011,"performance":1012,"against":1013,"recent":1014,"silent":1015,"incorrectness":1016,"compatibility":1017,"crashes":1018,"deadlocks":1019,"leaks":1020,"introduced":1021,"identifiers":1022,"ci":1023,"work":1024,"prs":1025,"merged":1026,"trunk":1027,"exception":1028,"manual":1029,"validations":1030,"e2e":1031,"validation":1032,"perform":1033,"regressions":1034,"benchmark":1035,"workflow":1036,"workflows":1037,"yml":1038,"current":1039,"coverage":1040,"llama3":1041,"llama4":1042,"hardware":1043,"h100":1044,"mi300x":1045,"_note":1046,"availability_":1047,"step":1048,"request":1049,"write":1050,"repository":1051,"run":1052,"review":1053,"setup":1054,"familiarize":1055,"yourself":1056,"configurations":1057,"tree":1058,"benchmarks":1059,"rocm":1060,"navigate":1061,"configure":1062,"set":1063,"v0":1064,"commit":1065,"results":1066,"once":1067,"completes":1068,"dashboard":1069,"hud":1070,"reponame":1071,"2fvllm":1072,"corresponding":1073,"comparison":1074,"compare":1075,"verify":1076,"occurred":1077,"example":1078,"vs":1079,"starttime":1080,"thu":1081,"2c":1082,"2017":1083,"20apr":1084,"202025":1085,"2021":1086,"3a43":1087,"3a50":1088,"20gmt":1089,"stoptime":1090,"wed":1091,"2016":1092,"20jul":1093,"granularity":1094,"week":1095,"lbranch":1096,"lcommit":1097,"b6553be1bc75f046b00046a4ad7576364d03c835":1098,"rbranch":1099,"rcommit":1100,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1101,"benchmarkname":1102,"modelname":1103,"20models":1104,"backendname":1105,"20backends":1106,"modename":1107,"20modes":1108,"dtypename":1109,"20dtype":1110,"devicename":1111,"20devices":1112,"archname":1113,"20platforms":1114,"benchmarking":1115,"readme":1116,"guides":1117,"running":1118,"tests":1119,"extensive":1120,"datasets":1121,"living":1122,"document":1123,"updated":1124,"become":1125,"dataset":1126,"overview":1127,"table":1128,"style":1129,"100":1130,"border":1131,"collapse":1132,"thead":1133,"tr":1134,"th":1135,"left":1136,"65":1137,"path":1138,"tbody":1139,"td":1140,"strong":1141,"sharegpt":1142,"wget":1143,"co":1144,"anon8231489123":1145,"sharegpt_vicuna_unfiltered":1146,"resolve":1147,"sharegpt_v3_unfiltered_cleaned_split":1148,"json":1149,"sharegpt4v":1150,"image":1151,"lin":1152,"chen":1153,"sharegpt4v_instruct_gpt4":1154,"vision_cap100k":1155,"br":1156,"div":1157,"images":1158,"downloaded":1159,"separately":1160,"download":1161,"coco":1162,"train":1163,"http":1164,"cocodataset":1165,"zips":1166,"train2017":1167,"zip":1168,"burstgpt":1169,"hpmll":1170,"burstgpt_without_fails_2":1171,"csv":1172,"sonnet":1173,"deprecated":1174,"txt":1175,"random":1176,"synthetic":1177,"repetition":1178,"visionarena":1179,"lmarena":1180,"instructcoder":1181,"likaixin":1182,"aimo":1183,"mo":1184,"aime":1185,"numinamath":1186,"cot":1187,"lmms":1188,"onevision":1189,"aeala":1190,"custom":1191,"jsonl":1192,"name":1193,"should":1194,"hf":1195,"show":1196,"nousresearch":1197,"hermes":1198,"8b":1199,"script":1200,"bench":1201,"backend":1202,"endpoint":1203,"completions":1204,"num":1205,"prompts":1206,"successful":1207,"output":1208,"result":1209,"duration":1210,"78":1211,"total":1212,"input":1213,"tokens":1214,"1369":1215,"generated":1216,"2212":1217,"req":1218,"73":1219,"token":1220,"tok":1221,"382":1222,"89":1223,"619":1224,"85":1225,"mean":1226,"ttft":1227,"ms":1228,"71":1229,"54":1230,"median":1231,"88":1232,"p99":1233,"79":1234,"49":1235,"per":1236,"excl":1237,"1st":1238,"tpot":1239,"91":1240,"96":1241,"inter":1242,"latency":1243,"itl":1244,"74":1245,"70":1246,"39":1247,"want":1248,"yet":1249,"even":1250,"customdataset":1251,"needs":1252,"prompt":1253,"field":1254,"entry":1255,"india":1256,"iran":1257,"vllm_use_v1":1258,"instruct":1259,"port":1260,"9001":1261,"save":1262,"detailed":1263,"skip":1264,"template":1265,"80":1266,"max":1267,"concurrency":1268,"temperature":1269,"top":1270,"75":1271,"dir":1272,"log":1273,"applying":1274,"already":1275,"vision":1276,"capability":1277,"qwen":1278,"qwen2":1279,"vl":1280,"7b":1281,"split":1282,"1000":1283,"config":1284,"method":1285,"ngram":1286,"num_speculative_tokens":1287,"prompt_lookup_max":1288,"prompt_lookup_min":1289,"2048":1290,"huggingfacedataset":1291,"subset":1292,"chart2text":1293,"cauldron":1294,"qwq":1295,"32b":1296,"seed":1297,"42":1298,"philschmid":1299,"mt":1300,"parameters":1301,"backends":1302,"client":1303,"command":1304,"ramp":1305,"up":1306,"rate":1307,"tool":1308,"ramping":1309,"over":1310,"useful":1311,"stress":1312,"finding":1313,"maximum":1314,"handle":1315,"given":1316,"budget":1317,"two":1318,"strategies":1319,"linear":1320,"increases":1321,"linearly":1322,"exponential":1323,"exponentially":1324,"arguments":1325,"strategy":1326,"rps":1327,"beginning":1328,"4656":1329,"00":1330,"1072":1331,"5014":1332,"1500":1333,"counts":1334,"4036":1335,"92":1336,"326":1337,"90":1338,"14527":1339,"1280":1340,"vllm_worker_multiproc_method":1341,"spawn":1342,"len":1343,"async":1344,"engine":1345,"104":1346,"77":1347,"23836":1348,"10477":1349,"261136":1350,"204800":1351,"adapters":1352,"dataset_path":1353,"dataset_name":1354,"loras":1355,"rank":1356,"enable":1357,"yard1":1358,"sql":1359,"structured":1360,"generation":1361,"grammar":1362,"regex":1363,"schema":1364,"python3":1365,"benchmark_serving_structured_output":1366,"py":1367,"ratio":1368,"structure":1369,"type":1370,"choice":1371,"xgrammar":1372,"xgrammar_bench":1373,"long":1374,"qa":1375,"question":1376,"answering":1377,"basic":1378,"benchmark_long_document_qa_throughput":1379,"documents":1380,"length":1381,"2000":1382,"50":1383,"repeat":1384,"count":1385,"different":1386,"mode":1387,"default":1388,"shuffle":1389,"randomly":1390,"3000":1391,"tile":1392,"entire":1393,"sequence":1394,"interleave":1395,"consecutively":1396,"efficiency":1397,"automatic":1398,"fixed":1399,"benchmark_prefix_caching":1400,"range":1401,"128":1402,"256":1403,"prefix_repetition":1404,"512":1405,"suffix":1406,"prefixes":1407,"prioritization":1408,"benchmark_prioritization":1409,"64":1410,"scheduling":1411,"priority":1412,"sequences":1413,"python":1414,"entrypoints":1415,"api_server":1416,"dtype":1417,"bfloat16":1418,"limit":1419,"mm":1420,"benchmark_serving":1421,"vllm_benchmark_results":1422,"completion":1423,"hide":1424,"navigation":1425,"toc":1426,"figure":1427,"markdown":1428,"span":1429,"class":1430,"60":1431,"defer":1432,"buttons":1433,"io":1434,"js":1435,"button":1436,"true":1437,"aria":1438,"label":1439,"star":1440,"subscription":1441,"icon":1442,"octicon":1443,"eye":1444,"watch":1445,"fork":1446,"forked":1447,"depends":1448,"looking":1449,"recommend":1450,"starting":1451,"applications":1452,"roadmap":1453,"gaudi":1454,"accelerators":1455,"power":1456,"trainium":1457,"inferentia":1458,"announcing":1459,"intro":1460,"sosp":1461,"23x":1462,"while":1463,"reducing":1464,"p50":1465,"cade":1466,"daniel":1467,"et":1468,"al":1469,"meetups":1470,"fill":1471,"description":1472,"ensuring":1473,"checklist":1474,"items":1475,"bottom":1476,"been":1477,"update":1478,"essential":1479,"elements":1480,"effective":1481,"fix":1482,"link":1483,"existing":1484,"pasting":1485,"necessary":1486,"updating":1487,"submitting":1488,"read":1489,"anything":1490,"line":1491,"removed":1492,"cutlass":1493,"epilogues":1494,"introduction":1495,"describes":1496,"implemented":1497,"fusing":1498,"de":1499,"operations":1500,"onto":1501,"gemms":1502,"currently":1503,"symmetric":1504,"weights":1505,"asymmetric":1506,"activations":1507,"quantized":1508,"scaledepilogue":1509,"bias":1510,"scaledepiloguebias":1511,"scaledepilogueazp":1512,"scaledepilogueazppertoken":1513,"reduce":1514,"instead":1515,"passed":1516,"epilogue":1517,"induces":1518,"redundant":1519,"addition":1520,"operation":1521,"runtime":1522,"underlying":1523,"algebra":1524,"activation":1525,"rfc":1526,"3975":1527,"widehat":1528,"matrices":1529,"math":1530,"s_a":1531,"j_a":1532,"z_a":1533,"s_b":1534,"gemm":1535,"scales":1536,"respectively":1537,"point":1538,"matrix":1539,"ones":1540,"dimensions":1541,"additional":1542,"expanding":1543,"further":1544,"calculate":1545,"follows":1546,"known":1547,"ahead":1548,"row":1549,"equal":1550,"mathbf":1551,"vector":1552,"column":1553,"sums":1554,"computes":1555,"meaning":1556,"scale_a":1557,"scalar":1558,"scale_b":1559,"always":1560,"because":1561,"term":1562,"precomputed":1563,"stored":1564,"azp_with_adj":1565,"points":1566,"efficiently":1567,"must":1568,"precompute":1569,"pass":1570,"kernel":1571,"above":1572,"means":1573,"becomes":1574,"outer":1575,"product":1576,"azp_adj":1577,"adjustment":1578,"azp":1579,"performs":1580,"computation":1581,"dq":1582,"machete":1583,"mixed":1584,"precision":1585,"spiritual":1586,"successor":1587,"marlin":1588,"hopper":1589,"architectures":1590,"pairs":1591,"easier":1592,"add":1593,"compared":1594,"effectively":1595,"scale_type":1596,"w_s":1597,"compute_type":1598,"w_q":1599,"w_z":1600,"weight":1601,"zeropoints":1602,"so":1603,"fma":1604,"pre":1605,"applied":1606,"supplied":1607,"assume":1608,"subtracted":1609,"optimization":1610,"prepacking":1611,"closely":1612,"match":1613,"core":1614,"layouts":1615,"allowing":1616,"wider":1617,"shared":1618,"loads":1619,"loading":1620,"prepacked":1621,"calling":1622,"machete_gemm":1623,"flow":1624,"looks":1625,"something":1626,"import":1627,"_custom_ops":1628,"ops":1629,"w_q_packed":1630,"machete_prepack_b":1631,"wtype":1632,"b_q":1633,"b_type":1634,"b_scales":1635,"b_group_size":1636,"group_size":1637,"generate":1638,"shapes":1639,"instantiations":1640,"typeconfig":1641,"appended":1642,"impl_configs":1643,"automatically":1644,"assuming":1645,"provide":1646,"implconfig":1647,"bundles":1648,"scheduleconfig":1649,"specialization":1650,"heuristic":1651,"info":1652,"scheduler":1653,"etc":1654,"differently":1655,"problem":1656,"almost":1657,"never":1658,"one":1659,"works":1660,"beneficial":1661,"comes":1662,"provided":1663,"maps":1664,"schedule":1665,"parameter":1666,"define":1667,"combinations":1668,"with_zeropoints":1669,"with_scales":1670,"compile":1671,"times":1672,"limiting":1673,"configuration":1674,"leverages":1675,"dictconfig":1676,"functionality":1677,"robust":1678,"loggers":1679,"offers":1680,"variables":1681,"accommodate":1682,"simple":1683,"inflexible":1684,"complex":1685,"vllm_configure_logging":1686,"leaving":1687,"vllm_logging_config_path":1688,"unset":1689,"leave":1690,"fine":1691,"grained":1692,"controls":1693,"whether":1694,"takes":1695,"enabled":1696,"disabled":1697,"root":1698,"logger":1699,"configured":1700,"error":1701,"occur":1702,"allows":1703,"specify":1704,"alternative":1705,"dictionary":1706,"customize":1707,"nhairs":1708,"part":1709,"container":1710,"stdout":1711,"console":1712,"begin":1713,"create":1714,"logging_config":1715,"formatters":1716,"pythonjsonlogger":1717,"jsonlogger":1718,"jsonformatter":1719,"handlers":1720,"streamhandler":1721,"formatter":1722,"stream":1723,"ext":1724,"sys":1725,"propagate":1726,"false":1727,"finally":1728,"variable":1729,"mistralai":1730,"silence":1731,"particular":1732,"target":1733,"configures":1734,"won":1735,"its":1736,"messages":1737,"overrides":1738,"logging_utils":1739,"newlineformatter":1740,"datefmt":1741,"levelname":1742,"asctime":1743,"filename":1744,"lineno":1745,"message":1746,"debug":1747,"example_noisy_logger":1748,"prevent":1749,"configuring":1750,"turn":1751,"silences":1752,"profiling":1753,"profile":1754,"decode":1755,"actual":1756,"mix":1757,"many":1758,"tested":1759,"v6e":1760,"installed":1761,"according":1762,"google_tpu":1763,"several":1764,"warmups":1765,"enforce":1766,"eager":1767,"okay":1768,"trace":1769,"runs":1770,"1024":1771,"attempt":1772,"export":1773,"xla_hlo_debug":1774,"vllm_tpu_profile_duration_ms":1775,"vllm_tpu_profile_delay_ms":1776,"batch":1777,"profiles":1778,"70b":1779,"32":1780,"decodes":1781,"having":1782,"extremely":1783,"small":1784,"hopefully":1785,"rm":1786,"rf":1787,"cache":1788,"xla_cache":1789,"visualizing":1790,"collected":1791,"visualize":1792,"tensorboard":1793,"xla":1794,"vm":1795,"likely":1796,"dependencies":1797,"tensorflow":1798,"cpu":1799,"plugin":1800,"etils":1801,"importlib_resources":1802,"directory":1803,"saved":1804,"localhost":1805,"6006":1806,"browser":1807,"logdir":1808,"important":1809,"performing":1810,"rest":1811,"consists":1812,"objects":1813,"lines":1814,"offline_inference":1815,"openai_batch":1816,"openai_example_batch":1817,"represents":1818,"separate":1819,"package":1820,"reference":1821,"platform":1822,"requestinput":1823,"embeddings":1824,"score":1825,"endpoints":1826,"coming":1827,"soon":1828,"requisites":1829,"hub":1830,"machine":1831,"cli":1832,"login":1833,"gated":1834,"visiting":1835,"card":1836,"agreeing":1837,"along":1838,"own":1839,"working":1840,"ve":1841,"look":1842,"cat":1843,"custom_id":1844,"url":1845,"role":1846,"content":1847,"helpful":1848,"assistant":1849,"hello":1850,"world":1851,"max_completion_tokens":1852,"unhelpful":1853,"designed":1854,"called":1855,"run_batch":1856,"383d1c59835645aeb2e07d004d62a826":1857,"cmpl":1858,"61c020e54b964d5a98fa7527bfcdd378":1859,"object":1860,"1715633336":1861,"choices":1862,"great":1863,"meet":1864,"help":1865,"tasks":1866,"mind":1867,"today":1868,"logprobs":1869,"null":1870,"finish_reason":1871,"stop":1872,"stop_reason":1873,"prompt_tokens":1874,"25":1875,"total_tokens":1876,"56":1877,"completion_tokens":1878,"31":1879,"42e3d09b14b04568afa3f1797751a267":1880,"f44d049f6b3a42d4b2d7850bb1e31bcc":1881,"files":1882,"runner":1883,"urls":1884,"accessible":1885,"located":1886,"integrating":1887,"s3":1888,"integrate":1889,"storage":1890,"presigned":1891,"prerequisites":1892,"bucket":1893,"amazon":1894,"amazons3":1895,"userguide":1896,"creating":1897,"awscli":1898,"credentials":1899,"interactively":1900,"boto3":1901,"upload":1902,"cp":1903,"my_bucket":1904,"my_input_file":1905,"sdk":1906,"sure":1907,"replace":1908,"my_output_file":1909,"placeholders":1910,"names":1911,"awsdocs":1912,"doc":1913,"example_code":1914,"s3_basics":1915,"presigned_url":1916,"botocore":1917,"exceptions":1918,"clienterror":1919,"def":1920,"generate_presigned_url":1921,"s3_client":1922,"client_method":1923,"method_parameters":1924,"expires_in":1925,"param":1926,"number":1927,"seconds":1928,"valid":1929,"return":1930,"try":1931,"clientmethod":1932,"params":1933,"expiresin":1934,"except":1935,"raise":1936,"input_url":1937,"get_object":1938,"3600":1939,"output_url":1940,"put_object":1941,"print":1942,"west":1943,"amazonaws":1944,"awsaccesskeyid":1945,"abcdefghijklmnopqrst":1946,"signature":1947,"abcdefghijklmnopqrstuvwxyz12345":1948,"expires":1949,"1715800091":1950,"section":1951,"terminal":1952,"intfloat":1953,"earlier":1954,"db0f71f7dec244e6bce530e0b4ef908b":1955,"status_code":1956,"200":1957,"request_id":1958,"3580bf4d4ae54d52b67eee266a6eab20":1959,"embd":1960,"33ac2efa7996430184461f2e38529746":1961,"444647":1962,"016204833984375":1963,"0092010498046875":1964,"0018358230590820312":1965,"0028228759765625":1966,"001422882080078125":1967,"0031147003173828125":1968,"baai":1969,"bge":1970,"reranker":1971,"m3":1972,"text_1":1973,"france":1974,"text_2":1975,"brazil":1976,"brasilia":1977,"paris":1978,"f87c5c4539184f618e555744a2965987":1979,"806ab64512e44071b37d3f7ccd291413":1980,"4ee45236897b4d29907d49b01298cdb1":1981,"1737847944":1982,"0010900497436523438":1983,"37":1984,"prompt_tokens_details":1985,"41990c51a26d4fac8419077f12871099":1986,"73ce66379026482699f81974e14e1e99":1987,"13f2ffe6ba40460fbf9f7f00ad667d75":1988,"001094818115234375":1989,"disaggregated":1990,"scripts":1991,"demonstrate":1992,"sh":1993,"helper":1994,"prefill_example":1995,"decode_example":1996,"sequentially":1997,"saving":1998,"kv":1999,"local_storage":2000,"provides":2001,"primary":2002,"interface":2003,"doing":2004,"interacting":2005,"shows":2006,"argument":2007,"parser":2008,"argparse":2009,"classify":2010,"embed":2011,"accept":2012,"inference_params":2013,"max_tokens":2014,"top_p":2015,"top_k":2016,"passing":2017,"experiment":2018,"specifies":2019,"loaded":2020,"get_default_sampling_params":2021,"auto":2022,"folder":2023,"max_new_tokens":2024,"sets":2025,"wide":2026,"gguf":2027,"downloading":2028,"huggingface_hub":2029,"hf_hub_download":2030,"repo_id":2031,"bartowski":2032,"phi":2033,"medium":2034,"4k":2035,"iq2_m":2036,"printed":2037,"tokenizer":2038,"microsoft":2039,"offload":2040,"gb":2041,"seen":2042,"virtual":2043,"way":2044,"increase":2045,"24":2046,"virtually":2047,"think":2048,"34":2049,"load":2050,"13b":2051,"bf16":2052,"requires":2053,"least":2054,"26gb":2055,"interconnect":2056,"fly":2057,"forward":2058,"omni":2059,"thinker":2060,"audio":2061,"video":2062,"qwen2_5_omni":2063,"only_thinker":2064,"mixed_modalities":2065,"inputs":2066,"interleaved":2067,"modalities":2068,"use_audio_in_video":2069,"audios":2070,"multi_audios":2071,"modality":2072,"audio_language":2073,"vision_language":2074,"lmcache":2075,"demonstrates":2076,"prefilling":2077,"offloading":2078,"nixl":2079,"simply":2080,"dynamo":2081,"hf_token":2082,"cd":2083,"disagg_prefill_lmcache_v1":2084,"disagg_example_nixl":2085,"components":2086,"disagg_vllm_launcher":2087,"launches":2088,"servers":2089,"proxy":2090,"disagg_proxy_server":2091,"fastapi":2092,"coordinates":2093,"prefiller":2094,"decoder":2095,"configs":2096,"yaml":2097,"generates":2098,"logs":2099,"cpu_offload_lmcache":2100,"implementation":2101,"kv_cache_sharing_lmcache_v1":2102,"share":2103,"caches":2104,"disaggregated_prefill_lmcache_v0":2105,"capabilities":2106,"constraint":2107,"responses":2108,"concurrent":2109,"3b":2110,"reasoning":2111,"r1":2112,"distill":2113,"deepseek_r1":2114,"standalone":2115,"uv":2116,"uvx":2117,"git":2118,"subdirectory":2119,"online_serving":2120,"structured_outputs":2121,"tip":2122,"remotely":2123,"openai_base_url":2124,"remote_url":2125,"constraints":2126,"structural_tag":2127,"opentelemetry":2128,"poc":2129,"packages":2130,"26":2131,"exporter":2132,"otlp":2133,"semantic":2134,"conventions":2135,"jaeger":2136,"docker":2137,"jaegertracing":2138,"57":2139,"collector_zipkin_host_port":2140,"9411":2141,"6831":2142,"udp":2143,"6832":2144,"5778":2145,"16686":2146,"4317":2147,"4318":2148,"14250":2149,"14268":2150,"14269":2151,"shell":2152,"ip":2153,"jaeger_ip":2154,"inspect":2155,"networksettings":2156,"ipaddress":2157,"otel_exporter_otlp_traces_endpoint":2158,"grpc":2159,"insecure":2160,"connections":2161,"otel_service_name":2162,"otel_exporter_otlp_traces_insecure":2163,"facebook":2164,"opt":2165,"125m":2166,"traces":2167,"context":2168,"dummy":2169,"dummy_client":2170,"webui":2171,"pane":2172,"select":2173,"hit":2174,"imgur":2175,"gyhhfjo":2176,"clicking":2177,"spans":2178,"tags":2179,"demo":2180,"containing":2181,"metadata":2182,"opf6cbl":2183,"protocol":2184,"protobuf":2185,"transport":2186,"otel_exporter_otlp_traces_protocol":2187,"instrumentation":2188,"instrument":2189,"hywvooj":2190,"disagg_proxy_demo":2191,"xpyd":2192,"kv_events":2193,"prometheus":2194,"grafana":2195,"connect":2196,"metric":2197,"stack":2198,"launch":2199,"checkout":2200,"methods":2201,"websites":2202,"compose":2203,"linux":2204,"entrypoint":2205,"submit":2206,"sample":2207,"navigating":2208,"8000":2209,"metrics":2210,"exposed":2211,"username":2212,"admin":2213,"password":2214,"datasources":2215,"page":2216,"connection":2217,"containers":2218,"creates":2219,"dns":2220,"9090":2221,"click":2222,"green":2223,"saying":2224,"successfully":2225,"queried":2226,"datasource":2227,"screen":2228,"r2vh9vw":2229,"helm":2230,"charts":2231,"chart":2232,"deploying":2233,"application":2234,"autoscaling":2235,"resource":2236,"defines":2237,"maintainers":2238,"ct":2239,"lintconf":2240,"linting":2241,"rules":2242,"values":2243,"validating":2244,"templates":2245,"_helpers":2246,"tpl":2247,"defining":2248,"configmap":2249,"configmaps":2250,"kubernetes":2251,"deployments":2252,"hpa":2253,"horizontal":2254,"pod":2255,"autoscaler":2256,"job":2257,"jobs":2258,"poddisruptionbudget":2259,"pvc":2260,"persistent":2261,"volume":2262,"claims":2263,"secrets":2264,"services":2265,"processing":2266,"exceeds":2267,"quick":2268,"very":2269,"texts":2270,"3m":2271,"model_name":2272,"jinaai":2273,"jina":2274,"max_embed_len":2275,"1048576":2276,"multilingual":2277,"3072000":2278,"comprehensive":2279,"startup":2280,"override":2281,"pooler":2282,"pooling_type":2283,"normalize":2284,"enable_chunked_processing":2285,"pooling":2286,"chunk":2287,"cross":2288,"aggregation":2289,"native":2290,"combination":2291,"component":2292,"chunks":2293,"weighted":2294,"averaging":2295,"optimal":2296,"processed":2297,"31090":2298,"gpu_count":2299,"cls":2300,"last":2301,"affects":2302,"api_key":2303,"empty":2304,"authentication":2305,"longer":2306,"max_model_len":2307,"smart":2308,"chunking":2309,"max_position_embeddings":2310,"maintain":2311,"unified":2312,"combined":2313,"across":2314,"dimensionality":2315,"standard":2316,"handling":2317,"accepted":2318,"rejected":2319,"vllm_allow_long_max_model_len":2320,"extreme":2321,"academic":2322,"papers":2323,"references":2324,"legal":2325,"contracts":2326,"books":2327,"chapters":2328,"repositories":2329,"codebases":2330,"aspect":2331,"minimal":2332,"proportional":2333,"scalable":2334,"quality":2335,"short":2336,"normal":2337,"baseline":2338,"100k":2339,"consistency":2340,"reproducible":2341,"troubleshooting":2342,"valueerror":2343,"position":2344,"4096":2345,"solution":2346,"runtimeerror":2347,"adjusting":2348,"fewer":2349,"slow":2350,"expected":2351,"due":2352,"calls":2353,"activity":2354,"150000":2355,"max_chunk_size":2356,"extend":2357,"architecture":2358,"lengths":2359,"validate":2360,"updates":2361,"simplified":2362,"millions":2363,"better":2364,"exceed":2365,"limits":2366,"backward":2367,"continue":2368,"communications":2369,"nodes":2370,"protected":2371,"placing":2372,"isolated":2373,"transfer":2374,"options":2375,"vllm_host_ip":2376,"processes":2377,"127":2378,"14579":2379,"data_parallel_master_ip":2380,"master":2381,"data_parallel_master_port":2382,"29500":2383,"considerations":2384,"intended":2385,"internal":2386,"untrusted":2387,"environments":2388,"networks":2389,"authorization":2390,"sent":2391,"unencrypted":2392,"anywhere":2393,"checks":2394,"isolation":2395,"deploy":2396,"segmentation":2397,"unauthorized":2398,"implement":2399,"firewall":2400,"practices":2401,"rather":2402,"firewalls":2403,"ports":2404,"restrict":2405,"proper":2406,"interfaces":2407,"principle":2408,"protecting":2409,"unsafe":2410,"frameworks":2411,"listening":2412,"sometimes":2413,"outside":2414,"direct":2415,"concern":2416,"torch":2417,"host":2418,"tcp":2419,"initialization":2420,"tcpstore":2421,"listens":2422,"unless":2423,"protections":2424,"put":2425,"place":2426,"reach":2427,"perspective":2428,"intentional":2429,"guidance":2430,"protect":2431,"carefully":2432,"expose":2433,"minimum":2434,"surface":2435,"area":2436,"block":2437,"trusted":2438,"hosts":2439,"internet":2440,"consult":2441,"instructions":2442,"believe":2443,"found":2444,"chosen":2445,"device":2446,"patterns":2447,"instance":2448,"production":2449,"training":2450,"rlhf":2451,"tune":2452,"stats":2453,"collection":2454,"collects":2455,"anonymous":2456,"engineering":2457,"understand":2458,"widely":2459,"prioritize":2460,"efforts":2461,"workloads":2462,"transparent":2463,"sensitive":2464,"cleaning":2465,"publicly":2466,"benefit":2467,"gh":2468,"usage_lib":2469,"uuid":2470,"fbe880e9":2471,"084d":2472,"4cab":2473,"a395":2474,"8984c50f1109":2475,"provider":2476,"gcp":2477,"num_cpu":2478,"cpu_type":2479,"xeon":2480,"20ghz":2481,"cpu_family_model_stepping":2482,"total_memory":2483,"101261135872":2484,"x86_64":2485,"28":2486,"amd64":2487,"glibc2":2488,"gpu_type":2489,"l4":2490,"gpu_memory_per_device":2491,"23580639232":2492,"model_architecture":2493,"optforcausallm":2494,"vllm_version":2495,"cu123":2496,"llm_class":2497,"log_time":2498,"1711663373492490000":2499,"float16":2500,"tensor_parallel_size":2501,"block_size":2502,"gpu_memory_utilization":2503,"kv_cache_dtype":2504,"enable_lora":2505,"enable_prefix_caching":2506,"enforce_eager":2507,"disable_custom_all_reduce":2508,"preview":2509,"tail":2510,"usage_stats":2511,"opting":2512,"vllm_no_usage_stats":2513,"do_not_track":2514,"mkdir":2515,"touch":2516,"exposes":2517,"health":2518,"unsloth":2519,"1b":2520,"query":2521,"curl":2522,"iteration_tokens_total":2523,"histogram":2524,"engine_step":2525,"iteration_tokens_total_sum":2526,"iteration_tokens_total_bucket":2527,"le":2528,"definitions":2529,"hidden":2530,"re":2531,"escape":2532,"hatch":2533,"outlines":2534,"consider":2535,"discovered":2536,"3aissue":2537,"choose":2538,"much":2539,"relevant":2540,"possible":2541,"debugged":2542,"remember":2543,"off":2544,"debugging":2545,"defined":2546,"avoid":2547,"lingering":2548,"settings":2549,"might":2550,"functionalities":2551,"activated":2552,"hangs":2553,"isn":2554,"disk":2555,"depend":2556,"recommended":2557,"isolate":2558,"pay":2559,"store":2560,"clusters":2561,"filesystems":2562,"filesystem":2563,"additionally":2564,"too":2565,"lot":2566,"slowing":2567,"down":2568,"frequently":2569,"swap":2570,"bottleneck":2571,"fit":2572,"oom":2573,"adopting":2574,"conserving_memory":2575,"consumption":2576,"changed":2577,"12622":2578,"prior":2579,"came":2580,"neutral":2581,"onwards":2582,"come":2583,"generation_config":2584,"creator":2585,"higher":2586,"know":2587,"however":2588,"degraded":2589,"happening":2590,"trying":2591,"old":2592,"improves":2593,"continuing":2594,"petition":2595,"produces":2596,"generations":2597,"don":2598,"solve":2599,"stuck":2600,"somewhere":2601,"vllm_logging_level":2602,"vllm_log_stats_interval":2603,"statistics":2604,"tracking":2605,"queue":2606,"waiting":2607,"states":2608,"cuda_launch_blocking":2609,"identify":2610,"causing":2611,"nccl_debug":2612,"nccl":2613,"vllm_trace_function":2614,"record":2615,"function":2616,"inspection":2617,"tell":2618,"flag":2619,"absolutely":2620,"delays":2621,"incorrect":2622,"cannot":2623,"correct":2624,"complicated":2625,"parallel_state":2626,"world_size":2627,"local_rank":2628,"distributed_init_method":2629,"xxx":2630,"54641":2631,"your_ip_address":2632,"nccl_socket_ifname":2633,"your_network_interface":2634,"gloo_socket_ifname":2635,"near":2636,"self":2637,"replay":2638,"captures":2639,"worker":2640,"model_runner":2641,"inside":2642,"cudagraph":2643,"causes":2644,"exact":2645,"driver":2646,"established":2647,"confirm":2648,"correctly":2649,"dist":2650,"init_process_group":2651,"get_rank":2652,"device_count":2653,"set_device":2654,"floattensor":2655,"all_reduce":2656,"op":2657,"reduceop":2658,"sum":2659,"synchronize":2660,"item":2661,"get_world_size":2662,"assert":2663,"got":2664,"gloo":2665,"gloo_group":2666,"new_group":2667,"ranks":2668,"cpu_data":2669,"exit":2670,"device_communicators":2671,"pynccl":2672,"pyncclcommunicator":2673,"manually":2674,"prefer":2675,"fill_":2676,"cuda_graph":2677,"current_stream":2678,"destroy_process_group":2679,"adjust":2680,"nproc":2681,"torchrun":2682,"nnodes":2683,"master_addr":2684,"reachable":2685,"rdzv_backend":2686,"c10d":2687,"rdzv_endpoint":2688,"sanity":2689,"usually":2690,"drivers":2691,"broken":2692,"sense":2693,"administrator":2694,"assistance":2695,"workaround":2696,"nccl_p2p_disable":2697,"helps":2698,"deeplearning":2699,"env":2700,"still":2701,"distnetworkerror":2702,"assign":2703,"commands":2704,"multiprocessing":2705,"multiproc_worker_utils":2706,"281":2707,"initialized":2708,"finished":2709,"bootstrapping":2710,"phase":2711,"probably":2712,"child":2713,"forgotten":2714,"idiom":2715,"module":2716,"__name__":2717,"__main__":2718,"freeze_support":2719,"omitted":2720,"program":2721,"going":2722,"frozen":2723,"produce":2724,"executable":2725,"safe":2726,"importing":2727,"guard":2728,"behind":2729,"heavily":2730,"optimize":2731,"introduces":2732,"dependency":2733,"triton":2734,"functions":2735,"10406":2736,"sin":2737,"randn":2738,"raises":2739,"_inductor":2740,"12219":2741,"failed":2742,"inspected":2743,"model_executor":2744,"registry":2745,"_raise_for_unsupported":2746,"arch":2747,"related":2748,"missing":2749,"outdated":2750,"binaries":2751,"traceback":2752,"call":2753,"inspect_model_cls":2754,"typeerror":2755,"nonetype":2756,"iterable":2757,"resolution":2758,"steps":2759,"model_resolution":2760,"explicitly":2761,"infer":2762,"platforms":2763,"__init__":2764,"infers":2765,"14195":2766,"unhandled":2767,"ncclcomminitrank":2768,"workload":2769,"gpudirect":2770,"rdma":2771,"encounters":2772,"executing":2773,"init_device":2774,"deadlock":2775,"usr":2776,"lib":2777,"99":2778,"comm":2779,"ncclcomm_t":2780,"pynccl_wrapper":2781,"277":2782,"nccl_check":2783,"_funcs":2784,"ctypes":2785,"byref":2786,"error_str":2787,"indicates":2788,"initialize":2789,"communicator":2790,"possibly":2791,"ipc_lock":2792,"unmounted":2793,"dev":2794,"shm":2795,"enabling":2796,"parallelism_scaling":2797,"properly":2798,"caused":2799,"zmq":2800,"zeromq":2801,"pyzmq":2802,"occasionally":2803,"hang":2804,"depending":2805,"6759":2806,"circumvent":2807,"1234":2808,"nccl_cumem_enable":2809,"cumem":2810,"allocator":2811,"gives":2812,"benefits":2813,"inconsistent":2814,"crash":2815,"observed":2816,"openrlhf":2817,"pull":2818,"604":2819,"discussion":2820,"5723":2821,"issuecomment":2822,"2554389656":2823,"deprecating":2824,"18571":2825,"gradually":2826,"inviter":2827,"reason":2828,"independently":2829,"grew":2830,"increasingly":2831,"complexity":2832,"harder":2833,"debt":2834,"revealing":2835,"streamlined":2836,"design":2837,"building":2838,"success":2839,"retains":2840,"proven":2841,"utilities":2842,"architects":2843,"covering":2844,"manager":2845,"sampler":2846,"cohesive":2847,"maintainable":2848,"framework":2849,"accommodates":2850,"growth":2851,"innovation":2852,"specifically":2853,"aims":2854,"modular":2855,"hack":2856,"codebase":2857,"combine":2858,"optimizations":2859,"upgrading":2860,"scenarios":2861,"published":2862,"limitations":2863,"actively":2864,"bring":2865,"therefore":2866,"constantly":2867,"progress":2868,"towards":2869,"falls":2870,"nearly":2871,"fully":2872,"planned":2873,"operational":2874,"ongoing":2875,"wip":2876,"active":2877,"scheduled":2878,"rfcs":2879,"delayed":2880,"temporarily":2881,"dropped":2882,"later":2883,"demand":2884,"treats":2885,"num_tokens":2886,"dynamically":2887,"allocate":2888,"prefills":2889,"strict":2890,"separation":2891,"phases":2892,"policies":2893,"served":2894,"fcfs":2895,"assigned":2896,"tie":2897,"breaker":2898,"configurable":2899,"nobr":2900,"x86":2901,"_64":2902,"aarch64":2903,"macos":2904,"plugins":2905,"ascend":2906,"spyre":2907,"openvino":2908,"encoder":2909,"mamba":2910,"excludes":2911,"supportsv0only":2912,"corresponds":2913,"initial":2914,"processor":2915,"12249":2916,"global":2917,"logits":2918,"13360":2919,"simultaneous":2920,"selective":2921,"space":2922,"mechanisms":2923,"layers":2924,"mamba2forcausallm":2925,"mambaforcausallm":2926,"disabling":2927,"bambaforcausallm":2928,"zamba2forcausallm":2929,"nemotronhforcausallm":2930,"falconh1forcausallm":2931,"granitemoehybridforcausallm":2932,"jambaforcausallm":2933,"hybrid":2934,"minimaxtext01forcausallm":2935,"minimaxm1forcausallm":2936,"requiring":2937,"bartforconditionalgeneration":2938,"mllamaforconditionalgeneration":2939,"calculation":2940,"devices":2941,"15191":2942,"spec":2943,"13414":2944,"best_of":2945,"13361":2946,"processors":2947,"swapping":2948,"differences":2949,"returned":2950,"immediately":2951,"computed":2952,"scaling":2953,"penalty":2954,"adjustments":2955,"reflect":2956,"adjusted":2957,"probabilities":2958,"turned":2959,"recomputation":2960,"recover":2961,"upon":2962,"rework":2963,"legacy":2964,"moving":2965,"preemptions":2966,"fallbacks":2967,"asked":2968,"referring":2969,"another":2970,"layer":2971,"route":2972,"accordingly":2973,"listed":2974,"extracting":2975,"convert":2976,"inferior":2977,"trained":2978,"vary":2979,"yes":2980,"guarantee":2981,"variations":2982,"numerical":2983,"instability":2984,"deterministic":2985,"batched":2986,"accuracy":2987,"numerical_accuracy":2988,"computations":2989,"slice":2990,"factors":2991,"expansion":2992,"slightly":2993,"logit":2994,"logprob":2995,"accumulate":2996,"potentially":2997,"resulting":2998,"sampled":2999,"divergence":3000,"mitigation":3001,"improved":3002,"stability":3003,"reduced":3004,"variance":3005,"float32":3006,"switching":3007,"seeds":3008,"aid":3009,"achieving":3010,"discrepancies":3011,"reproducibility":3012,"sake":3013,"achieve":3014,"vllm_enable_v1_multiprocessing":3015,"locality":3016,"impossible":3017,"generators":3018,"np":3019,"manual_seed":3020,"none":3021,"remain":3022,"un":3023,"workers":3024,"17929":3025,"constructs":3026,"worry":3027,"accidentally":3028,"making":3029,"subsequent":3030,"rely":3031,"modelconfig":3032,"cacheconfig":3033,"loadconfig":3034,"parallelconfig":3035,"schedulerconfig":3036,"deviceconfig":3037,"speculativeconfig":3038,"loraconfig":3039,"multimodalconfig":3040,"poolerconfig":3041,"decodingconfig":3042,"observabilityconfig":3043,"kvtransferconfig":3044,"compilationconfig":3045,"vllmconfig":3046,"prompttype":3047,"textprompt":3048,"tokensprompt":3049,"engines":3050,"llmengine":3051,"asyncllmengine":3052,"apis":3053,"samplingparams":3054,"poolingparams":3055,"experimental":3056,"alongside":3057,"multi_modal_data":3058,"multimodal_registry":3059,"facing":3060,"multimodaldatadict":3061,"structures":3062,"placeholderrange":3063,"nestedtensors":3064,"multimodalfieldelem":3065,"multimodalfieldconfig":3066,"multimodalkwargsitem":3067,"multimodalkwargs":3068,"multimodalinputs":3069,"parsing":3070,"parse":3071,"interfaces_base":3072,"generative":3073,"covers":3074,"vllmmodelfortextgeneration":3075,"obtain":3076,"option":3077,"vast":3078,"majority":3079,"detect":3080,"initializing":3081,"counterpart":3082,"transformers":3083,"main_classes":3084,"text_generation":3085,"generationmixin":3086,"tokenization":3087,"detokenization":3088,"my":3089,"generated_text":3090,"optionally":3091,"greedy":3092,"exists":3093,"preferred":3094,"beam_search":3095,"implements":3096,"generation_strategies":3097,"beams":3098,"sampling_params":3099,"beamsearchparams":3100,"beam_width":3101,"accepts":3102,"chat_templating":3103,"general":3104,"instruction":3105,"tuned":3106,"poorly":3107,"respond":3108,"conversation":3109,"assist":3110,"essay":3111,"importance":3112,"doesn":3113,"chat_utils":3114,"load_chat_template":3115,"custom_template":3116,"chat_template":3117,"path_to_template":3118,"openai_compatible_server":3119,"correspond":3120,"multimodal_inputs":3121,"generative_models":3122,"pooling_models":3123,"task":3124,"natively":3125,"implementations":3126,"modeling":3127,"apply_model":3128,"transformersforcausallm":3129,"transformersformultimodallm":3130,"force":3131,"model_impl":3132,"impl":3133,"optimise":3134,"comparing":3135,"whole":3136,"contrast":3137,"attribute":3138,"backbone":3139,"slight":3140,"difference":3141,"neither":3142,"customizing":3143,"custom_models":3144,"present":3145,"auto_map":3146,"automodel":3147,"writing":3148,"customisation":3149,"done":3150,"mymodel":3151,"mymodelforcausallm":3152,"trust_remote_code":3153,"model_dir":3154,"modifications":3155,"kwargs":3156,"modules":3157,"myattention":3158,"all_attention_functions":3159,"_supports_attention_backend":3160,"modeling_my_model":3161,"pretrainedmodel":3162,"nn":3163,"hidden_states":3164,"attention_interface":3165,"_attn_implementation":3166,"attn_output":3167,"attn_weights":3168,"query_states":3169,"key_states":3170,"value_states":3171,"happens":3172,"background":3173,"is_backend_compatible":3174,"base_model_tp_plan":3175,"base_model_pp_plan":3176,"configuration_my_model":3177,"pretrainedconfig":3178,"myconfig":3179,"self_attn":3180,"k_proj":3181,"colwise":3182,"v_proj":3183,"o_proj":3184,"rowwise":3185,"mlp":3186,"gate_proj":3187,"up_proj":3188,"down_proj":3189,