{"class":0,"passconfig":1,"configuration":2,"custom":3,"inductor":4,"passes":5,"separate":6,"from":7,"general":8,"compilationconfig":9,"so":10,"don":11,"all":12,"have":13,"access":14,"full":15,"would":16,"create":17,"cycle":18,"passmanager":19,"set":20,"property":21,"config":22,"enable_fusion":23,"bool":24,"field":25,"default_factory":26,"lambda":27,"envs":28,"vllm_use_v1":29,"whether":30,"enable":31,"fusion":32,"rmsnorm":33,"silumul":34,"quant":35,"pass":36,"enable_attn_fusion":37,"false":38,"attention":39,"enable_noop":40,"op":41,"elimination":42,"enable_sequence_parallelism":43,"sequence":44,"parallelism":45,"enable_async_tp":46,"async":47,"tp":48,"enable_fi_allreduce_fusion":49,"flashinfer":50,"allreduce":51,"fi_allreduce_fusion_max_token_num":52,"int":53,"16384":54,"max":55,"number":56,"tokens":57,"used":58,"todo":59,"luka":60,"better":61,"enabling":62,"system":63,"def":64,"uuid":65,"self":66,"produces":67,"hash":68,"unique":69,"any":70,"new":71,"fields":72,"affect":73,"compilation":74,"should":75,"added":76,"future":77,"excluded":78,"return":79,"inductorpass":80,"hash_dict":81,"asdict":82,"__post_init__":83,"none":84,"logger":85,"warning_once":86,"enabled":87,"reshape":88,"disabled":89,"fp8":90,"might":91,"work":92,"dataclass":93,"test":94,"nvlink":95,"first":96,"filter":97,"out":98,"most":99,"cases":100,"where":101,"supported":102,"checks":103,"hardware":104,"driver":105,"support":106,"assert":107,"current_platform":108,"is_cuda_alike":109,"fully_connected":110,"is_fully_connected":111,"physical_device_ids":112,"world_size":113,"warning":114,"because":115,"more":116,"than":117,"two":118,"pcie":119,"only":120,"gpus":121,"silence":122,"specify":123,"disable_custom_all_reduce":124,"true":125,"explicitly":126,"p2p":127,"capability":128,"software":129,"cudaruntime":130,"expensive":131,"compute":132,"time":133,"we":134,"cache":135,"result":136,"amd":137,"gpu":138,"always":139,"between":140,"xgmi":141,"connected":142,"is_rocm":143,"_can_p2p":144,"rank":145,"your":146,"platform":147,"lacks":148,"failed":149,"cudacommunicator":150,"devicecommunicatorbase":151,"__init__":152,"cpu_group":153,"processgroup":154,"device":155,"optional":156,"torch":157,"device_group":158,"unique_name":159,"str":160,"super":161,"uses":162,"use_custom_allreduce":163,"else":164,"vllm":165,"distributed":166,"parallel_state":167,"import":168,"_enable_custom_all_reduce":169,"ep":170,"does":171,"use":172,"pynccl":173,"use_pynccl":174,"lazy":175,"avoid":176,"documentation":177,"build":178,"error":179,"device_communicators":180,"custom_all_reduce":181,"customallreduce":182,"pyncclcommunicator":183,"quick_all_reduce":184,"quickallreduce":185,"pynccl_comm":186,"group":187,"ca_comm":188,"qr_comm":189,"initialize":190,"fast":191,"reduce":192,"implementation":193,"_supported_world_sizes":194,"max_size":195,"size":196,"union":197,"8192":198,"1024":199,"args":200,"process":201,"default":202,"bind":203,"cuda":204,"local_rank":205,"caller":206,"responsibility":207,"make":208,"sure":209,"each":210,"communicator":211,"communicators":212,"same":213,"node":214,"_is_capturing":215,"custom_ar":216,"disable":217,"missing":218,"library":219,"non":220,"environment":221,"info":222,"dist":223,"get_backend":224,"backend":225,"nccl":226,"attached":227,"in_the_same_node_as":228,"source_rank":229,"need":230,"multi":231,"case":232,"spans":233,"across":234,"nodes":235,"get_rank":236,"get_world_size":237,"single":238,"quick_ar":239,"quick":240,"quickreduce":241,"due":242,"unsupported":243,"world":244,"sizes":245,"isinstance":246,"elif":247,"kernel":248,"mi3":249,"cards":250,"choice":251,"quantization":252,"level":253,"fp":254,"int8":255,"int6":256,"int4":257,"recommended":258,"large":259,"models":260,"get":261,"vllm_rocm_quick_reduce_quantization":262,"os":263,"getenv":264,"upper":265,"lack":266,"bfloat16":267,"asm":268,"instruction":269,"kernels":270,"slower":271,"fp16":272,"variable":273,"input":274,"converted":275,"vllm_rocm_quick_reduce_cast_bf16_to_fp16":276,"lower":277,"controls":278,"maximum":279,"allowed":280,"data":281,"bytes":282,"mb":283,"communication":284,"2048":285,"exceeding":286,"either":287,"rccl":288,"vllm_rocm_quick_reduce_max_size_bytes_mb":289,"maybe_convert_int":290,"environ":291,"divisor":292,"dynamic":293,"query":294,"scale":295,"factor":296,"calculation":297,"kv":298,"q_scale_constant":299,"200":300,"key":301,"k_scale_constant":302,"value":303,"v_scale_constant":304,"100":305,"multiprocessing":306,"llm":307,"v1":308,"code":309,"path":310,"vllm_enable_v1_multiprocessing":311,"vllm_log_batchsize_interval":312,"float":313,"vllm_disable_compile_cache":314,"regime_str":315,"debug":316,"based":317,"env":318,"qr_quant_level":319,"quickreduceregime":320,"vllm_config":321,"get_current_vllm_config":322,"hasattr":323,"model_config":324,"dtype":325,"float16":326,"supports":327,"use_fp16_kernels":328,"bf16":329,"inputs":330,"improve":331,"performance":332,"turn":333,"off":334,"specified":335,"qr_max_size":336,"you":337,"smaller":338,"1mb":339,"which":340,"can":341,"lead":342,"degradation":343,"_ptr":344,"ops":345,"init_custom_qr":346,"create_shared_buffer":347,"aiter":348,"paged":349,"vllm_rocm_use_aiter_paged_attn":350,"linear":351,"following":352,"list":353,"related":354,"scaled_mm":355,"per":356,"tensor":357,"rowwise":358,"vllm_rocm_use_aiter_linear":359,"moe":360,"vllm_rocm_use_aiter_moe":361,"rms":362,"norm":363,"vllm_rocm_use_aiter_rmsnorm":364,"mla":365,"vllm_rocm_use_aiter_mla":366,"mha":367,"vllm_rocm_use_aiter_mha":368,"rocm":369,"skinny":370,"gemms":371,"vllm_rocm_use_skinny_gemm":372,"pad":373,"weights":374,"256":375,"vllm_rocm_fp8_padding":376,"vllm_rocm_moe_padding":377,"vllm_rocm_custom_paged_attn":378,"_supported_dtypes":379,"tests":380,"order":381,"_qr_min_size":382,"16":383,"64":384,"provides":385,"destructive":386,"acceleration":387,"available":388,"mi300":389,"series":390,"leverages":391,"further":392,"currently":393,"q8":394,"q6":395,"q4":396,"formats":397,"designed":398,"complement":399,"its":400,"initialization":401,"requires":402,"even":403,"stricter":404,"conditions":405,"_rocm_arch_available":406,"main":407,"api":408,"graph":409,"when":410,"should_custom_ar":411,"is_current_stream_capturing":412,"all_reduce":413,"registered":414,"warm":415,"up":416,"mimic":417,"allocation":418,"pattern":419,"since":420,"place":421,"empty_like":422,"note":423,"outside":424,"context":425,"incurs":426,"cost":427,"cudamemcpy":428,"small":429,"overall":430,"latency":431,"compared":432,"gain":433,"using":434,"close":435,"dispose":436,"free_shared_buffer":437,"meta_ptrs":438,"buffer_ptrs":439,"__del__":440,"staticmethod":441,"size_in_bytes":442,"uncached":443,"pointer":444,"handle":445,"allocate_shared_buffer_and_handle":446,"handles":447,"all_gather_object":448,"":449}